src/integ-test/bdd-test/resources/xml/nodoChiediCatalogoServiziV2_noOptional.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
	<soapenv:Header/>
	<soapenv:Body>
		<nod:nodoChiediCatalogoServiziV2Request>
			<identificativoPSP>$identificativoPSP</identificativoPSP>
			<identificativoIntermediarioPSP>$identificativoIntermediarioPSP</identificativoIntermediarioPSP>
			<identificativoCanale>$identificativoCanale</identificativoCanale>
			<password>$password</password>
		</nod:nodoChiediCatalogoServiziV2Request>
	</soapenv:Body>
</soapenv:Envelope>